/**
 ****************************************************************************************************
 * @file        lvgl_demo.h
 * @version     V1.0
 * @date        2023-04-01
 * @brief       LVGL lv_arc(圆弧) 实验
 ****************************************************************************************************
 * @attention
 *
 * 实验平台:STM32H743开发板
 *
 ****************************************************************************************************
 */
 
#ifndef __LVGL_DEMO_H
#define __LVGL_DEMO_H

#include "app_runtime.h"

void lvgl_demo(void);
void fan_sensor_status_read(void);   /* lvgl例程 */

#endif
