/**
 ****************************************************************************************************
 * @file        mpu.h
 * @version     V1.0
 * @date        2022-09-06
 * @brief       MPU 驱动代码
 ****************************************************************************************************
 * @attention
 *
 * 实验平台:STM32H743开发板
 *
 * 修改说明
 * V1.0 20220906
 * 第一次发布
 *
 ****************************************************************************************************
 */
 
#ifndef __MPU_H
#define __MPU_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/

uint8_t mpu_set_protection(uint32_t baseaddr, uint32_t size, uint32_t rnum, uint8_t de, uint8_t ap, uint8_t sen, uint8_t cen, uint8_t ben);
void mpu_memory_protection(void);

#endif


